## Series

In [55]:
import pandas as pd
import numpy as np

In [56]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [57]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [58]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [59]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [60]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [61]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Rússia', 'Japão'])

In [62]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [63]:
ser2 = pd.Series([1, 2, 5, 4], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [64]:
ser2

EUA         1
Alemanha    2
Itália      5
Japão       4
dtype: int64

In [65]:
ser1[['EUA', 'Alemanha', 'Rússia']]

EUA         1
Alemanha    2
Rússia      3
dtype: int64

In [66]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
Rússia      NaN
dtype: float64

## DataFrames

In [67]:
from numpy.random import randn

In [68]:
df = pd.DataFrame(randn(5,4), index= ["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [69]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [70]:
type(df)

pandas.core.frame.DataFrame

In [71]:
df[['W']]

          W
A -0.022274
B -1.391072
C -0.607558
D  0.997645
E  0.890700

In [72]:
df['new'] = df['W'] + df['X']

In [73]:
df

          W         X         Y         Z       new
A -0.022274 -0.750704  1.565279 -0.906719 -0.772978
B -1.391072 -0.497202 -0.433315 -0.008826 -1.888274
C -0.607558  0.186548 -0.261075 -0.126447 -0.421010
D  0.997645 -1.344346  0.479573  0.445665 -0.346701
E  0.890700  0.914807 -1.804116  0.815858  1.805507

In [74]:
df2 = df.drop('new', axis=1)

In [75]:
df

          W         X         Y         Z       new
A -0.022274 -0.750704  1.565279 -0.906719 -0.772978
B -1.391072 -0.497202 -0.433315 -0.008826 -1.888274
C -0.607558  0.186548 -0.261075 -0.126447 -0.421010
D  0.997645 -1.344346  0.479573  0.445665 -0.346701
E  0.890700  0.914807 -1.804116  0.815858  1.805507

In [76]:
df2

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [77]:
df.drop('new', axis=1, inplace=True)

In [78]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [79]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826

In [80]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826

In [81]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [82]:
df.iloc[:-1, 1:4]

          X         Y         Z
A -0.750704  1.565279 -0.906719
B -0.497202 -0.433315 -0.008826
C  0.186548 -0.261075 -0.126447
D -1.344346  0.479573  0.445665

In [83]:
df.iloc[1:3, 2:]

          Y         Z
B -0.433315 -0.008826
C -0.261075 -0.126447

In [84]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [85]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B  False  False  False  False
C  False   True  False  False
D   True  False   True   True
E   True   True  False   True

In [86]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  1.565279       NaN
B       NaN       NaN       NaN       NaN
C       NaN  0.186548       NaN       NaN
D  0.997645       NaN  0.479573  0.445665
E  0.890700  0.914807       NaN  0.815858

In [87]:
df['Y'] > 0

A     True
B    False
C    False
D     True
E    False
Name: Y, dtype: bool

In [88]:
df[df['Y'] > 0]

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
D  0.997645 -1.344346  0.479573  0.445665

In [89]:
df[(df['Y'] > 0) & (df['Z'] > 0)]

          W         X         Y         Z
D  0.997645 -1.344346  0.479573  0.445665

## Mais detalhes do Índice

In [90]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [91]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [92]:
df

          W         X         Y         Z
A -0.022274 -0.750704  1.565279 -0.906719
B -1.391072 -0.497202 -0.433315 -0.008826
C -0.607558  0.186548 -0.261075 -0.126447
D  0.997645 -1.344346  0.479573  0.445665
E  0.890700  0.914807 -1.804116  0.815858

In [93]:
df.reset_index(inplace=True)

In [94]:
df

  index         W         X         Y         Z
0     A -0.022274 -0.750704  1.565279 -0.906719
1     B -1.391072 -0.497202 -0.433315 -0.008826
2     C -0.607558  0.186548 -0.261075 -0.126447
3     D  0.997645 -1.344346  0.479573  0.445665
4     E  0.890700  0.914807 -1.804116  0.815858

In [95]:
df.set_index("index", inplace=True)

In [96]:
df

              W         X         Y         Z
index
A     -0.022274 -0.750704  1.565279 -0.906719
B     -1.391072 -0.497202 -0.433315 -0.008826
C     -0.607558  0.186548 -0.261075 -0.126447
D      0.997645 -1.344346  0.479573  0.445665
E      0.890700  0.914807 -1.804116  0.815858

In [97]:
tabela = pd.DataFrame(randn(3, 6), index = "D M G".split(), columns = "G U E R R A".split())

In [98]:
tabela

          G         U         E         R         R         A
D  0.390975 -0.282203  0.849051  0.576523  0.300568  0.958332
M -1.060492 -0.790290  1.518789 -0.474171 -0.751637 -0.278104
G -1.161083 -0.693901 -0.492290  1.372292  0.163729  1.008287

In [99]:
tabela.iloc[1:, 1:4]

          U         E         R
M -0.790290  1.518789 -0.474171
G -0.693901 -0.492290  1.372292

## Hierarquia de Índices e Índices múltiplos

In [100]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [101]:
inside = [1, 2, 3, 1, 2, 3]

In [102]:
hier_index = list(zip(outside, inside))

In [103]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [104]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [105]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [106]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index, columns = ['A', 'B'])

In [107]:
df

             A         B
G1 1 -0.864758 -0.547972
   2  0.878554 -0.005577
   3 -0.399708  0.546921
G2 1 -2.101930  0.884277
   2 -0.582534 -0.854851
   3 -0.876803  1.012394

In [110]:
df.loc['G1'].loc[[1]]

          A         B
1 -0.864758 -0.547972

In [111]:
df.index.names = ['Grupo', 'Número']

In [112]:
df

                     A         B
Grupo Número
G1    1      -0.864758 -0.547972
      2       0.878554 -0.005577
      3      -0.399708  0.546921
G2    1      -2.101930  0.884277
      2      -0.582534 -0.854851
      3      -0.876803  1.012394

In [113]:
df.xs(1, level = 'Número')

              A         B
Grupo
G1    -0.864758 -0.547972
G2    -2.101930  0.884277